IDEA StatiCa Open Model
ResultOfNLAPoint Class
Compatible with IDEA StatiCa Beta 21.0 - beta
Note: This API is now obsolete.
 Result of internal forces in the one position
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.ResultOfNLAPoint
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
[ObsoleteAttribute]
public class ResultOfNLAPoint
<ObsoleteAttribute>
Public Class ResultOfNLAPoint
[ObsoleteAttribute]
public ref class ResultOfNLAPoint
The ResultOfNLAPoint type exposes the following members.
Constructors
Name | Description
ResultOfNLAPoint
 Constructor
Top
Properties
Name | Description
Id
 Id of point
ResultOfIncrements
 Results in load case
X
 X coordinates on cross-section
Y
 Y coordinates on cross-section
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace